MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140F8/mcu.h
typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCR0;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCR1;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCR2;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCR3;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCR4;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCR5;
    union
    {
        __IO uint8_t OCSR10;
        stc_timer4_ocsr10_field_t OCSR10_f;
    };
    uint8_t RESERVED7[1];
    union
    {
        __IO uint16_t OCER10;
        stc_timer4_ocer10_field_t OCER10_f;
    };
    union
    {
        __IO uint8_t OCSR32;
        stc_timer4_ocsr32_field_t OCSR32_f;
    };
    uint8_t RESERVED9[1];
    union
    {
        __IO uint16_t OCER32;
        stc_timer4_ocer32_field_t OCER32_f;
    };
    union
    {
        __IO uint8_t OCSR54;
        stc_timer4_ocsr54_field_t OCSR54_f;
    };
    uint8_t RESERVED11[1];
    union
    {
        __IO uint16_t OCER54;
        stc_timer4_ocer54_field_t OCER54_f;
    };
    union
    {
        __IO uint16_t OCMR0;
        stc_timer4_ocmr0_field_t OCMR0_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint32_t OCMR1;
        stc_timer4_ocmr1_field_t OCMR1_f;
    };
    union
    {
        __IO uint16_t OCMR2;
        stc_timer4_ocmr2_field_t OCMR2_f;
    };
    uint8_t RESERVED15[2];
    union
    {
        __IO uint32_t OCMR3;
        stc_timer4_ocmr3_field_t OCMR3_f;
    };
    union
    {
        __IO uint16_t OCMR4;
        stc_timer4_ocmr4_field_t OCMR4_f;
    };
    uint8_t RESERVED17[2];
    union
    {
        __IO uint32_t OCMR5;
        stc_timer4_ocmr5_field_t OCMR5_f;
    };
    uint8_t RESERVED18[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED19[2];
    __IO uint16_t CISR;
    union
    {
        __IO uint16_t CCSR;
        stc_timer4_ccsr_field_t CCSR_f;
    };
    union
    {
        __IO uint16_t CIMR;
        stc_timer4_cimr_field_t CIMR_f;
    };
    uint8_t RESERVED22[54];
    __IO uint16_t PFSR10;
    __IO uint16_t PDRA10;
    __IO uint16_t PDRB10;
    uint8_t RESERVED25[2];
    __IO uint16_t PFSR32;
    __IO uint16_t PDRA32;
    __IO uint16_t PDRB32;
    uint8_t RESERVED28[2];
    __IO uint16_t PFSR54;
    __IO uint16_t PDRA54;
    __IO uint16_t PDRB54;
    union
    {
        __IO uint8_t POCR10;
        stc_timer4_pocr10_field_t POCR10_f;
    };
    uint8_t RESERVED32[3];
    union
    {
        __IO uint8_t POCR32;
        stc_timer4_pocr32_field_t POCR32_f;
    };
    uint8_t RESERVED33[3];
    union
    {
        __IO uint8_t POCR54;
        stc_timer4_pocr54_field_t POCR54_f;
    };
    uint8_t RESERVED34[3];
    union
    {
        __IO uint16_t RCSR;
        stc_timer4_rcsr_field_t RCSR_f;
    };
    uint8_t RESERVED35[12];
    __IO uint16_t ATVR0;
    uint8_t RESERVED36[2];
    __IO uint16_t ATVR1;
    uint8_t RESERVED37[2];
    __IO uint16_t ATVR2;
    uint8_t RESERVED38[2];
    __IO uint16_t ATVR3;
    uint8_t RESERVED39[2];
    __IO uint16_t ATVR4;
    uint8_t RESERVED40[2];
    __IO uint16_t ATVR5;
    union
    {
        __IO uint8_t ATCR0;
        stc_timer4_atcr0_field_t ATCR0_f;
    };
    union
    {
        __IO uint8_t ATER0;
        stc_timer4_ater0_field_t ATER0_f;
    };
    union
    {
        __IO uint8_t ATMR0;
        stc_timer4_atmr0_field_t ATMR0_f;
    };
    uint8_t RESERVED44[1];
    union
    {
        __IO uint8_t ATCR1;
        stc_timer4_atcr1_field_t ATCR1_f;
    };
    union
    {
        __IO uint8_t ATER1;
        stc_timer4_ater1_field_t ATER1_f;
    };
    union
    {
        __IO uint8_t ATMR1;
        stc_timer4_atmr1_field_t ATMR1_f;
    };
    uint8_t RESERVED47[1];
    union
    {
        __IO uint8_t ATCR2;
        stc_timer4_atcr2_field_t ATCR2_f;
    };
    union
    {
        __IO uint8_t ATER2;
        stc_timer4_ater2_field_t ATER2_f;
    };
    union
    {
        __IO uint8_t ATMR2;
        stc_timer4_atmr2_field_t ATMR2_f;
    };
    uint8_t RESERVED50[1];
    union
    {
        __IO uint8_t ATCR3;
        stc_timer4_atcr3_field_t ATCR3_f;
    };
    union
    {
        __IO uint8_t ATER3;
        stc_timer4_ater3_field_t ATER3_f;
    };
    union
    {
        __IO uint8_t ATMR3;
        stc_timer4_atmr3_field_t ATMR3_f;
    };
    uint8_t RESERVED53[1];
    union
    {
        __IO uint8_t ATCR4;
        stc_timer4_atcr4_field_t ATCR4_f;
    };
    union
    {
        __IO uint8_t ATER4;
        stc_timer4_ater4_field_t ATER4_f;
    };
    union
    {
        __IO uint8_t ATMR4;
        stc_timer4_atmr4_field_t ATMR4_f;
    };
    uint8_t RESERVED56[1];
    union
    {
        __IO uint8_t ATCR5;
        stc_timer4_atcr5_field_t ATCR5_f;
    };
    union
    {
        __IO uint8_t ATER5;
        stc_timer4_ater5_field_t ATER5_f;
    };
    union
    {
        __IO uint8_t ATMR5;
        stc_timer4_atmr5_field_t ATMR5_f;
    };
    uint8_t RESERVED59[17];
    union
    {
        __IO uint16_t ESCR;
        stc_timer4_escr_field_t ESCR_f;
    };
}M0P_TIMER4_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t UIDR0;
        stc_uid_uidr0_field_t UIDR0_f;
    };
    union
    {
        __IO uint32_t UIDR1;
        stc_uid_uidr1_field_t UIDR1_f;
    };
    union
    {
        __IO uint32_t UIDR2;
        stc_uid_uidr2_field_t UIDR2_f;
    };
}M0P_UID_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t VC_CTL1;
        stc_vc_ctl1_field_t VC_CTL1_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint16_t VC_CTL2;
        stc_vc_ctl2_field_t VC_CTL2_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t VC_CTL3;
        stc_vc_ctl3_field_t VC_CTL3_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t LVD1_SET;
        stc_wsunit_lvd1_set_field_t LVD1_SET_f;
    };
    union
    {
        __IO uint32_t LVD_INT_STR;
        stc_wsunit_lvd_int_str_field_t LVD_INT_STR_f;
    };
    union
    {
        __IO uint32_t LVD_CLR;
        stc_wsunit_lvd_clr_field_t LVD_CLR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t LVD2_SET;
        stc_wsunit_lvd2_set_field_t LVD2_SET_f;
    };
    uint8_t RESERVED4[1772];
    union
    {
        __IO uint8_t BUR01;
        stc_wsunit_bur01_field_t BUR01_f;
    };
    union
    {
        __IO uint8_t BUR02;
        stc_wsunit_bur02_field_t BUR02_f;
    };
    union
    {
        __IO uint8_t BUR03;
        stc_wsunit_bur03_field_t BUR03_f;
    };
    union
    {
        __IO uint8_t BUR04;
        stc_wsunit_bur04_field_t BUR04_f;
    };
    union
    {
        __IO uint8_t BUR05;
        stc_wsunit_bur05_field_t BUR05_f;
    };
    union
    {
        __IO uint8_t BUR06;
        stc_wsunit_bur06_field_t BUR06_f;
    };
    union
    {
        __IO uint8_t BUR07;
        stc_wsunit_bur07_field_t BUR07_f;
    };
    union
    {
        __IO uint8_t BUR08;
        stc_wsunit_bur08_field_t BUR08_f;
    };
    union
    {
        __IO uint8_t BUR09;
        stc_wsunit_bur09_field_t BUR09_f;
    };
    union
    {
        __IO uint8_t BUR10;
        stc_wsunit_bur10_field_t BUR10_f;
    };
    union
    {
        __IO uint8_t BUR11;
        stc_wsunit_bur11_field_t BUR11_f;
    };
    union
    {
        __IO uint8_t BUR12;
        stc_wsunit_bur12_field_t BUR12_f;
    };
    union
    {
        __IO uint8_t BUR13;
        stc_wsunit_bur13_field_t BUR13_f;
    };
    union
    {
        __IO uint8_t BUR14;
        stc_wsunit_bur14_field_t BUR14_f;
    };
    union
    {
        __IO uint8_t BUR15;
        stc_wsunit_bur15_field_t BUR15_f;
    };
    union
    {
        __IO uint8_t BUR16;
        stc_wsunit_bur16_field_t BUR16_f;
    };
}M0P_WSUNIT_TypeDef;



