MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140F8/mcu.h
#define bM0P_DMAC_SRC_ADR0_SRC_ADR9                     *((volatile unsigned int*)(0x42C00324UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR10                    *((volatile unsigned int*)(0x42C00328UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR11                    *((volatile unsigned int*)(0x42C0032CUL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR12                    *((volatile unsigned int*)(0x42C00330UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR13                    *((volatile unsigned int*)(0x42C00334UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR14                    *((volatile unsigned int*)(0x42C00338UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR15                    *((volatile unsigned int*)(0x42C0033CUL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR16                    *((volatile unsigned int*)(0x42C00340UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR17                    *((volatile unsigned int*)(0x42C00344UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR18                    *((volatile unsigned int*)(0x42C00348UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR19                    *((volatile unsigned int*)(0x42C0034CUL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR20                    *((volatile unsigned int*)(0x42C00350UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR21                    *((volatile unsigned int*)(0x42C00354UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR22                    *((volatile unsigned int*)(0x42C00358UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR23                    *((volatile unsigned int*)(0x42C0035CUL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR24                    *((volatile unsigned int*)(0x42C00360UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR25                    *((volatile unsigned int*)(0x42C00364UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR26                    *((volatile unsigned int*)(0x42C00368UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR27                    *((volatile unsigned int*)(0x42C0036CUL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR28                    *((volatile unsigned int*)(0x42C00370UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR29                    *((volatile unsigned int*)(0x42C00374UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR30                    *((volatile unsigned int*)(0x42C00378UL))
#define bM0P_DMAC_SRC_ADR0_SRC_ADR31                    *((volatile unsigned int*)(0x42C0037CUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR0                     *((volatile unsigned int*)(0x42C00380UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR1                     *((volatile unsigned int*)(0x42C00384UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR2                     *((volatile unsigned int*)(0x42C00388UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR3                     *((volatile unsigned int*)(0x42C0038CUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR4                     *((volatile unsigned int*)(0x42C00390UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR5                     *((volatile unsigned int*)(0x42C00394UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR6                     *((volatile unsigned int*)(0x42C00398UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR7                     *((volatile unsigned int*)(0x42C0039CUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR8                     *((volatile unsigned int*)(0x42C003A0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR9                     *((volatile unsigned int*)(0x42C003A4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR10                    *((volatile unsigned int*)(0x42C003A8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR11                    *((volatile unsigned int*)(0x42C003ACUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR12                    *((volatile unsigned int*)(0x42C003B0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR13                    *((volatile unsigned int*)(0x42C003B4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR14                    *((volatile unsigned int*)(0x42C003B8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR15                    *((volatile unsigned int*)(0x42C003BCUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR16                    *((volatile unsigned int*)(0x42C003C0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR17                    *((volatile unsigned int*)(0x42C003C4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR18                    *((volatile unsigned int*)(0x42C003C8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR19                    *((volatile unsigned int*)(0x42C003CCUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR20                    *((volatile unsigned int*)(0x42C003D0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR21                    *((volatile unsigned int*)(0x42C003D4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR22                    *((volatile unsigned int*)(0x42C003D8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR23                    *((volatile unsigned int*)(0x42C003DCUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR24                    *((volatile unsigned int*)(0x42C003E0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR25                    *((volatile unsigned int*)(0x42C003E4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR26                    *((volatile unsigned int*)(0x42C003E8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR27                    *((volatile unsigned int*)(0x42C003ECUL))
#define bM0P_DMAC_DST_ADR0_DST_ADR28                    *((volatile unsigned int*)(0x42C003F0UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR29                    *((volatile unsigned int*)(0x42C003F4UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR30                    *((volatile unsigned int*)(0x42C003F8UL))
#define bM0P_DMAC_DST_ADR0_DST_ADR31                    *((volatile unsigned int*)(0x42C003FCUL))
#define bM0P_DMAC_CONFA1_TC0                            *((volatile unsigned int*)(0x42C00400UL))
#define bM0P_DMAC_CONFA1_TC1                            *((volatile unsigned int*)(0x42C00404UL))
#define bM0P_DMAC_CONFA1_TC2                            *((volatile unsigned int*)(0x42C00408UL))
#define bM0P_DMAC_CONFA1_TC3                            *((volatile unsigned int*)(0x42C0040CUL))
#define bM0P_DMAC_CONFA1_TC4                            *((volatile unsigned int*)(0x42C00410UL))
#define bM0P_DMAC_CONFA1_TC5                            *((volatile unsigned int*)(0x42C00414UL))
#define bM0P_DMAC_CONFA1_TC6                            *((volatile unsigned int*)(0x42C00418UL))
#define bM0P_DMAC_CONFA1_TC7                            *((volatile unsigned int*)(0x42C0041CUL))
#define bM0P_DMAC_CONFA1_TC8                            *((volatile unsigned int*)(0x42C00420UL))
#define bM0P_DMAC_CONFA1_TC9                            *((volatile unsigned int*)(0x42C00424UL))
#define bM0P_DMAC_CONFA1_TC10                           *((volatile unsigned int*)(0x42C00428UL))
#define bM0P_DMAC_CONFA1_TC11                           *((volatile unsigned int*)(0x42C0042CUL))
#define bM0P_DMAC_CONFA1_TC12                           *((volatile unsigned int*)(0x42C00430UL))
#define bM0P_DMAC_CONFA1_TC13                           *((volatile unsigned int*)(0x42C00434UL))
#define bM0P_DMAC_CONFA1_TC14                           *((volatile unsigned int*)(0x42C00438UL))
#define bM0P_DMAC_CONFA1_TC15                           *((volatile unsigned int*)(0x42C0043CUL))
#define bM0P_DMAC_CONFA1_BC0                            *((volatile unsigned int*)(0x42C00440UL))
#define bM0P_DMAC_CONFA1_BC1                            *((volatile unsigned int*)(0x42C00444UL))
#define bM0P_DMAC_CONFA1_BC2                            *((volatile unsigned int*)(0x42C00448UL))
#define bM0P_DMAC_CONFA1_BC3                            *((volatile unsigned int*)(0x42C0044CUL))
#define bM0P_DMAC_CONFA1_TRI_SEL0                       *((volatile unsigned int*)(0x42C0045CUL))
#define bM0P_DMAC_CONFA1_TRI_SEL1                       *((volatile unsigned int*)(0x42C00460UL))
#define bM0P_DMAC_CONFA1_TRI_SEL2                       *((volatile unsigned int*)(0x42C00464UL))
#define bM0P_DMAC_CONFA1_TRI_SEL3                       *((volatile unsigned int*)(0x42C00468UL))
#define bM0P_DMAC_CONFA1_TRI_SEL4                       *((volatile unsigned int*)(0x42C0046CUL))
#define bM0P_DMAC_CONFA1_TRI_SEL5                       *((volatile unsigned int*)(0x42C00470UL))
#define bM0P_DMAC_CONFA1_ST                             *((volatile unsigned int*)(0x42C00474UL))
#define bM0P_DMAC_CONFA1_PAS                            *((volatile unsigned int*)(0x42C00478UL))
#define bM0P_DMAC_CONFA1_ENS                            *((volatile unsigned int*)(0x42C0047CUL))
#define bM0P_DMAC_CONFB1_MSK                            *((volatile unsigned int*)(0x42C00480UL))
#define bM0P_DMAC_CONFB1_STAT0                          *((volatile unsigned int*)(0x42C004C0UL))
#define bM0P_DMAC_CONFB1_STAT1                          *((volatile unsigned int*)(0x42C004C4UL))
#define bM0P_DMAC_CONFB1_STAT2                          *((volatile unsigned int*)(0x42C004C8UL))
#define bM0P_DMAC_CONFB1_FIS_IE                         *((volatile unsigned int*)(0x42C004CCUL))
#define bM0P_DMAC_CONFB1_ERR_IE                         *((volatile unsigned int*)(0x42C004D0UL))
#define bM0P_DMAC_CONFB1_RD                             *((volatile unsigned int*)(0x42C004D4UL))
#define bM0P_DMAC_CONFB1_RS                             *((volatile unsigned int*)(0x42C004D8UL))
#define bM0P_DMAC_CONFB1_RC                             *((volatile unsigned int*)(0x42C004DCUL))
#define bM0P_DMAC_CONFB1_FD                             *((volatile unsigned int*)(0x42C004E0UL))
#define bM0P_DMAC_CONFB1_FS                             *((volatile unsigned int*)(0x42C004E4UL))
#define bM0P_DMAC_CONFB1_WIDTH0                         *((volatile unsigned int*)(0x42C004E8UL))
#define bM0P_DMAC_CONFB1_WIDTH1                         *((volatile unsigned int*)(0x42C004ECUL))
#define bM0P_DMAC_CONFB1_MODE0                          *((volatile unsigned int*)(0x42C004F0UL))
#define bM0P_DMAC_CONFB1_MODE1                          *((volatile unsigned int*)(0x42C004F4UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR0                     *((volatile unsigned int*)(0x42C00500UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR1                     *((volatile unsigned int*)(0x42C00504UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR2                     *((volatile unsigned int*)(0x42C00508UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR3                     *((volatile unsigned int*)(0x42C0050CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR4                     *((volatile unsigned int*)(0x42C00510UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR5                     *((volatile unsigned int*)(0x42C00514UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR6                     *((volatile unsigned int*)(0x42C00518UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR7                     *((volatile unsigned int*)(0x42C0051CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR8                     *((volatile unsigned int*)(0x42C00520UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR9                     *((volatile unsigned int*)(0x42C00524UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR10                    *((volatile unsigned int*)(0x42C00528UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR11                    *((volatile unsigned int*)(0x42C0052CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR12                    *((volatile unsigned int*)(0x42C00530UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR13                    *((volatile unsigned int*)(0x42C00534UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR14                    *((volatile unsigned int*)(0x42C00538UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR15                    *((volatile unsigned int*)(0x42C0053CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR16                    *((volatile unsigned int*)(0x42C00540UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR17                    *((volatile unsigned int*)(0x42C00544UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR18                    *((volatile unsigned int*)(0x42C00548UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR19                    *((volatile unsigned int*)(0x42C0054CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR20                    *((volatile unsigned int*)(0x42C00550UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR21                    *((volatile unsigned int*)(0x42C00554UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR22                    *((volatile unsigned int*)(0x42C00558UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR23                    *((volatile unsigned int*)(0x42C0055CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR24                    *((volatile unsigned int*)(0x42C00560UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR25                    *((volatile unsigned int*)(0x42C00564UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR26                    *((volatile unsigned int*)(0x42C00568UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR27                    *((volatile unsigned int*)(0x42C0056CUL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR28                    *((volatile unsigned int*)(0x42C00570UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR29                    *((volatile unsigned int*)(0x42C00574UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR30                    *((volatile unsigned int*)(0x42C00578UL))
#define bM0P_DMAC_SRC_ADR1_SRC_ADR31                    *((volatile unsigned int*)(0x42C0057CUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR0                     *((volatile unsigned int*)(0x42C00580UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR1                     *((volatile unsigned int*)(0x42C00584UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR2                     *((volatile unsigned int*)(0x42C00588UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR3                     *((volatile unsigned int*)(0x42C0058CUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR4                     *((volatile unsigned int*)(0x42C00590UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR5                     *((volatile unsigned int*)(0x42C00594UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR6                     *((volatile unsigned int*)(0x42C00598UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR7                     *((volatile unsigned int*)(0x42C0059CUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR8                     *((volatile unsigned int*)(0x42C005A0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR9                     *((volatile unsigned int*)(0x42C005A4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR10                    *((volatile unsigned int*)(0x42C005A8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR11                    *((volatile unsigned int*)(0x42C005ACUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR12                    *((volatile unsigned int*)(0x42C005B0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR13                    *((volatile unsigned int*)(0x42C005B4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR14                    *((volatile unsigned int*)(0x42C005B8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR15                    *((volatile unsigned int*)(0x42C005BCUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR16                    *((volatile unsigned int*)(0x42C005C0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR17                    *((volatile unsigned int*)(0x42C005C4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR18                    *((volatile unsigned int*)(0x42C005C8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR19                    *((volatile unsigned int*)(0x42C005CCUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR20                    *((volatile unsigned int*)(0x42C005D0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR21                    *((volatile unsigned int*)(0x42C005D4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR22                    *((volatile unsigned int*)(0x42C005D8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR23                    *((volatile unsigned int*)(0x42C005DCUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR24                    *((volatile unsigned int*)(0x42C005E0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR25                    *((volatile unsigned int*)(0x42C005E4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR26                    *((volatile unsigned int*)(0x42C005E8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR27                    *((volatile unsigned int*)(0x42C005ECUL))
#define bM0P_DMAC_DST_ADR1_DST_ADR28                    *((volatile unsigned int*)(0x42C005F0UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR29                    *((volatile unsigned int*)(0x42C005F4UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR30                    *((volatile unsigned int*)(0x42C005F8UL))
#define bM0P_DMAC_DST_ADR1_DST_ADR31                    *((volatile unsigned int*)(0x42C005FCUL))
#define bM0P_DTIM1_TIMERCTRL_ONESHOT                    *((volatile unsigned int*)(0x422A0100UL))
#define bM0P_DTIM1_TIMERCTRL_TMRSIZE                    *((volatile unsigned int*)(0x422A0104UL))
#define bM0P_DTIM1_TIMERCTRL_TMRPRE0                    *((volatile unsigned int*)(0x422A0108UL))
#define bM0P_DTIM1_TIMERCTRL_TMRPRE1                    *((volatile unsigned int*)(0x422A010CUL))
#define bM0P_DTIM1_TIMERCTRL_INTEN                      *((volatile unsigned int*)(0x422A0114UL))
#define bM0P_DTIM1_TIMERCTRL_TMRMODE                    *((volatile unsigned int*)(0x422A0118UL))
#define bM0P_DTIM1_TIMERCTRL_TMREN                      *((volatile unsigned int*)(0x422A011CUL))
#define bM0P_DTIM1_TIMERRIS_TMRINTST                    *((volatile unsigned int*)(0x422A0200UL))
#define bM0P_DTIM1_TIMERMIS_TMRMINTST                   *((volatile unsigned int*)(0x422A0280UL))
#define bM0P_DTIM2_TIMERCTRL_ONESHOT                    *((volatile unsigned int*)(0x422A0500UL))
#define bM0P_DTIM2_TIMERCTRL_TMRSIZE                    *((volatile unsigned int*)(0x422A0504UL))
#define bM0P_DTIM2_TIMERCTRL_TMRPRE0                    *((volatile unsigned int*)(0x422A0508UL))
#define bM0P_DTIM2_TIMERCTRL_TMRPRE1                    *((volatile unsigned int*)(0x422A050CUL))
#define bM0P_DTIM2_TIMERCTRL_INTEN                      *((volatile unsigned int*)(0x422A0514UL))
#define bM0P_DTIM2_TIMERCTRL_TMRMODE                    *((volatile unsigned int*)(0x422A0518UL))
#define bM0P_DTIM2_TIMERCTRL_TMREN                      *((volatile unsigned int*)(0x422A051CUL))
#define bM0P_DTIM2_TIMERRIS_TMRINTST                    *((volatile unsigned int*)(0x422A0600UL))
#define bM0P_DTIM2_TIMERMIS_TMRMINTST                   *((volatile unsigned int*)(0x422A0680UL))
#define bM0P_EXTINT_INTEN_EN0                           *((volatile unsigned int*)(0x42600000UL))
#define bM0P_EXTINT_INTEN_EN1                           *((volatile unsigned int*)(0x42600004UL))
#define bM0P_EXTINT_INTEN_EN2                           *((volatile unsigned int*)(0x42600008UL))
#define bM0P_EXTINT_INTEN_EN3                           *((volatile unsigned int*)(0x4260000CUL))
#define bM0P_EXTINT_INTEN_EN4                           *((volatile unsigned int*)(0x42600010UL))
#define bM0P_EXTINT_INTEN_EN5                           *((volatile unsigned int*)(0x42600014UL))
#define bM0P_EXTINT_INTEN_EN6                           *((volatile unsigned int*)(0x42600018UL))
#define bM0P_EXTINT_INTEN_EN7                           *((volatile unsigned int*)(0x4260001CUL))
#define bM0P_EXTINT_INTEN_EN8                           *((volatile unsigned int*)(0x42600020UL))
#define bM0P_EXTINT_INTEN_EN9                           *((volatile unsigned int*)(0x42600024UL))
#define bM0P_EXTINT_INTEN_EN10                          *((volatile unsigned int*)(0x42600028UL))
#define bM0P_EXTINT_INTEN_EN11                          *((volatile unsigned int*)(0x4260002CUL))
#define bM0P_EXTINT_INTEN_EN12                          *((volatile unsigned int*)(0x42600030UL))
#define bM0P_EXTINT_INTEN_EN13                          *((volatile unsigned int*)(0x42600034UL))
#define bM0P_EXTINT_INTEN_EN14                          *((volatile unsigned int*)(0x42600038UL))
#define bM0P_EXTINT_INTEN_EN15                          *((volatile unsigned int*)(0x4260003CUL))
#define bM0P_EXTINT_INTSRC_SRC0                         *((volatile unsigned int*)(0x42600080UL))
#define bM0P_EXTINT_INTSRC_SRC1                         *((volatile unsigned int*)(0x42600084UL))
#define bM0P_EXTINT_INTSRC_SRC2                         *((volatile unsigned int*)(0x42600088UL))
#define bM0P_EXTINT_INTSRC_SRC3                         *((volatile unsigned int*)(0x4260008CUL))
#define bM0P_EXTINT_INTSRC_SRC4                         *((volatile unsigned int*)(0x42600090UL))
#define bM0P_EXTINT_INTSRC_SRC5                         *((volatile unsigned int*)(0x42600094UL))
#define bM0P_EXTINT_INTSRC_SRC6                         *((volatile unsigned int*)(0x42600098UL))
#define bM0P_EXTINT_INTSRC_SRC7                         *((volatile unsigned int*)(0x4260009CUL))
#define bM0P_EXTINT_INTSRC_SRC8                         *((volatile unsigned int*)(0x426000A0UL))
#define bM0P_EXTINT_INTSRC_SRC9                         *((volatile unsigned int*)(0x426000A4UL))
#define bM0P_EXTINT_INTSRC_SRC10                        *((volatile unsigned int*)(0x426000A8UL))
#define bM0P_EXTINT_INTSRC_SRC11                        *((volatile unsigned int*)(0x426000ACUL))
#define bM0P_EXTINT_INTSRC_SRC12                        *((volatile unsigned int*)(0x426000B0UL))
#define bM0P_EXTINT_INTSRC_SRC13                        *((volatile unsigned int*)(0x426000B4UL))
#define bM0P_EXTINT_INTSRC_SRC14                        *((volatile unsigned int*)(0x426000B8UL))
#define bM0P_EXTINT_INTSRC_SRC15                        *((volatile unsigned int*)(0x426000BCUL))
#define bM0P_EXTINT_INTCLR_CLR0                         *((volatile unsigned int*)(0x42600100UL))
#define bM0P_EXTINT_INTCLR_CLR1                         *((volatile unsigned int*)(0x42600104UL))
#define bM0P_EXTINT_INTCLR_CLR2                         *((volatile unsigned int*)(0x42600108UL))
#define bM0P_EXTINT_INTCLR_CLR3                         *((volatile unsigned int*)(0x4260010CUL))
#define bM0P_EXTINT_INTCLR_CLR4                         *((volatile unsigned int*)(0x42600110UL))
#define bM0P_EXTINT_INTCLR_CLR5                         *((volatile unsigned int*)(0x42600114UL))
#define bM0P_EXTINT_INTCLR_CLR6                         *((volatile unsigned int*)(0x42600118UL))
#define bM0P_EXTINT_INTCLR_CLR7                         *((volatile unsigned int*)(0x4260011CUL))
#define bM0P_EXTINT_INTCLR_CLR8                         *((volatile unsigned int*)(0x42600120UL))
#define bM0P_EXTINT_INTCLR_CLR9                         *((volatile unsigned int*)(0x42600124UL))
#define bM0P_EXTINT_INTCLR_CLR10                        *((volatile unsigned int*)(0x42600128UL))
#define bM0P_EXTINT_INTCLR_CLR11                        *((volatile unsigned int*)(0x4260012CUL))
#define bM0P_EXTINT_INTCLR_CLR12                        *((volatile unsigned int*)(0x42600130UL))
#define bM0P_EXTINT_INTCLR_CLR13                        *((volatile unsigned int*)(0x42600134UL))
#define bM0P_EXTINT_INTCLR_CLR14                        *((volatile unsigned int*)(0x42600138UL))
#define bM0P_EXTINT_INTCLR_CLR15                        *((volatile unsigned int*)(0x4260013CUL))
#define bM0P_EXTINT_INTLVL_LVLL0                        *((volatile unsigned int*)(0x42600180UL))
#define bM0P_EXTINT_INTLVL_LVLH0                        *((volatile unsigned int*)(0x42600184UL))
#define bM0P_EXTINT_INTLVL_LVLL1                        *((volatile unsigned int*)(0x42600188UL))
#define bM0P_EXTINT_INTLVL_LVLH1                        *((volatile unsigned int*)(0x4260018CUL))
#define bM0P_EXTINT_INTLVL_LVLL2                        *((volatile unsigned int*)(0x42600190UL))
#define bM0P_EXTINT_INTLVL_LVLH2                        *((volatile unsigned int*)(0x42600194UL))
#define bM0P_EXTINT_INTLVL_LVLL3                        *((volatile unsigned int*)(0x42600198UL))
#define bM0P_EXTINT_INTLVL_LVLH3                        *((volatile unsigned int*)(0x4260019CUL))
#define bM0P_EXTINT_INTLVL_LVLL4                        *((volatile unsigned int*)(0x426001A0UL))
#define bM0P_EXTINT_INTLVL_LVLH4                        *((volatile unsigned int*)(0x426001A4UL))
#define bM0P_EXTINT_INTLVL_LVLL5                        *((volatile unsigned int*)(0x426001A8UL))
#define bM0P_EXTINT_INTLVL_LVLH5                        *((volatile unsigned int*)(0x426001ACUL))
#define bM0P_EXTINT_INTLVL_LVLL6                        *((volatile unsigned int*)(0x426001B0UL))
#define bM0P_EXTINT_INTLVL_LVLH6                        *((volatile unsigned int*)(0x426001B4UL))
#define bM0P_EXTINT_INTLVL_LVLL7                        *((volatile unsigned int*)(0x426001B8UL))
