MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32M140F8/mcu.h
#define bM0P_WSUNIT_BUR09_BUR095                        *((volatile unsigned int*)(0x426AE114UL))
#define bM0P_WSUNIT_BUR09_BUR096                        *((volatile unsigned int*)(0x426AE118UL))
#define bM0P_WSUNIT_BUR09_BUR097                        *((volatile unsigned int*)(0x426AE11CUL))
#define bM0P_WSUNIT_BUR10_BUR100                        *((volatile unsigned int*)(0x426AE120UL))
#define bM0P_WSUNIT_BUR10_BUR101                        *((volatile unsigned int*)(0x426AE124UL))
#define bM0P_WSUNIT_BUR10_BUR102                        *((volatile unsigned int*)(0x426AE128UL))
#define bM0P_WSUNIT_BUR10_BUR103                        *((volatile unsigned int*)(0x426AE12CUL))
#define bM0P_WSUNIT_BUR10_BUR104                        *((volatile unsigned int*)(0x426AE130UL))
#define bM0P_WSUNIT_BUR10_BUR105                        *((volatile unsigned int*)(0x426AE134UL))
#define bM0P_WSUNIT_BUR10_BUR106                        *((volatile unsigned int*)(0x426AE138UL))
#define bM0P_WSUNIT_BUR10_BUR107                        *((volatile unsigned int*)(0x426AE13CUL))
#define bM0P_WSUNIT_BUR11_BUR110                        *((volatile unsigned int*)(0x426AE140UL))
#define bM0P_WSUNIT_BUR11_BUR111                        *((volatile unsigned int*)(0x426AE144UL))
#define bM0P_WSUNIT_BUR11_BUR112                        *((volatile unsigned int*)(0x426AE148UL))
#define bM0P_WSUNIT_BUR11_BUR113                        *((volatile unsigned int*)(0x426AE14CUL))
#define bM0P_WSUNIT_BUR11_BUR114                        *((volatile unsigned int*)(0x426AE150UL))
#define bM0P_WSUNIT_BUR11_BUR115                        *((volatile unsigned int*)(0x426AE154UL))
#define bM0P_WSUNIT_BUR11_BUR116                        *((volatile unsigned int*)(0x426AE158UL))
#define bM0P_WSUNIT_BUR11_BUR117                        *((volatile unsigned int*)(0x426AE15CUL))
#define bM0P_WSUNIT_BUR12_BUR120                        *((volatile unsigned int*)(0x426AE160UL))
#define bM0P_WSUNIT_BUR12_BUR121                        *((volatile unsigned int*)(0x426AE164UL))
#define bM0P_WSUNIT_BUR12_BUR122                        *((volatile unsigned int*)(0x426AE168UL))
#define bM0P_WSUNIT_BUR12_BUR123                        *((volatile unsigned int*)(0x426AE16CUL))
#define bM0P_WSUNIT_BUR12_BUR124                        *((volatile unsigned int*)(0x426AE170UL))
#define bM0P_WSUNIT_BUR12_BUR125                        *((volatile unsigned int*)(0x426AE174UL))
#define bM0P_WSUNIT_BUR12_BUR126                        *((volatile unsigned int*)(0x426AE178UL))
#define bM0P_WSUNIT_BUR12_BUR127                        *((volatile unsigned int*)(0x426AE17CUL))
#define bM0P_WSUNIT_BUR13_BUR130                        *((volatile unsigned int*)(0x426AE180UL))
#define bM0P_WSUNIT_BUR13_BUR131                        *((volatile unsigned int*)(0x426AE184UL))
#define bM0P_WSUNIT_BUR13_BUR132                        *((volatile unsigned int*)(0x426AE188UL))
#define bM0P_WSUNIT_BUR13_BUR133                        *((volatile unsigned int*)(0x426AE18CUL))
#define bM0P_WSUNIT_BUR13_BUR134                        *((volatile unsigned int*)(0x426AE190UL))
#define bM0P_WSUNIT_BUR13_BUR135                        *((volatile unsigned int*)(0x426AE194UL))
#define bM0P_WSUNIT_BUR13_BUR136                        *((volatile unsigned int*)(0x426AE198UL))
#define bM0P_WSUNIT_BUR13_BUR137                        *((volatile unsigned int*)(0x426AE19CUL))
#define bM0P_WSUNIT_BUR14_BUR140                        *((volatile unsigned int*)(0x426AE1A0UL))
#define bM0P_WSUNIT_BUR14_BUR141                        *((volatile unsigned int*)(0x426AE1A4UL))
#define bM0P_WSUNIT_BUR14_BUR142                        *((volatile unsigned int*)(0x426AE1A8UL))
#define bM0P_WSUNIT_BUR14_BUR143                        *((volatile unsigned int*)(0x426AE1ACUL))
#define bM0P_WSUNIT_BUR14_BUR144                        *((volatile unsigned int*)(0x426AE1B0UL))
#define bM0P_WSUNIT_BUR14_BUR145                        *((volatile unsigned int*)(0x426AE1B4UL))
#define bM0P_WSUNIT_BUR14_BUR146                        *((volatile unsigned int*)(0x426AE1B8UL))
#define bM0P_WSUNIT_BUR14_BUR147                        *((volatile unsigned int*)(0x426AE1BCUL))
#define bM0P_WSUNIT_BUR15_BUR150                        *((volatile unsigned int*)(0x426AE1C0UL))
#define bM0P_WSUNIT_BUR15_BUR151                        *((volatile unsigned int*)(0x426AE1C4UL))
#define bM0P_WSUNIT_BUR15_BUR152                        *((volatile unsigned int*)(0x426AE1C8UL))
#define bM0P_WSUNIT_BUR15_BUR153                        *((volatile unsigned int*)(0x426AE1CCUL))
#define bM0P_WSUNIT_BUR15_BUR154                        *((volatile unsigned int*)(0x426AE1D0UL))
#define bM0P_WSUNIT_BUR15_BUR155                        *((volatile unsigned int*)(0x426AE1D4UL))
#define bM0P_WSUNIT_BUR15_BUR156                        *((volatile unsigned int*)(0x426AE1D8UL))
#define bM0P_WSUNIT_BUR15_BUR157                        *((volatile unsigned int*)(0x426AE1DCUL))
#define bM0P_WSUNIT_BUR16_BUR160                        *((volatile unsigned int*)(0x426AE1E0UL))
#define bM0P_WSUNIT_BUR16_BUR161                        *((volatile unsigned int*)(0x426AE1E4UL))
#define bM0P_WSUNIT_BUR16_BUR162                        *((volatile unsigned int*)(0x426AE1E8UL))
#define bM0P_WSUNIT_BUR16_BUR163                        *((volatile unsigned int*)(0x426AE1ECUL))
#define bM0P_WSUNIT_BUR16_BUR164                        *((volatile unsigned int*)(0x426AE1F0UL))
#define bM0P_WSUNIT_BUR16_BUR165                        *((volatile unsigned int*)(0x426AE1F4UL))
#define bM0P_WSUNIT_BUR16_BUR166                        *((volatile unsigned int*)(0x426AE1F8UL))
#define bM0P_WSUNIT_BUR16_BUR167                        *((volatile unsigned int*)(0x426AE1FCUL))


#ifdef __cplusplus
}
#endif

#endif /* __HC32M140FX_H__ */

